Autodesk.Revit.DB.PropertySetLibrary.ExportXml(System.String)
Export this property set library to an external, XML-based file.
fileName:
Name of the file to write.
Returns:
True if the export succeeded, otherwise false.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidPathArgumentException:
The folder does not exist.
Since:
2012

Autodesk.Revit.DB.PropertySetLibrary.ImportXml(Autodesk.Revit.DB.Document,System.String,System.Boolean)
Import an external property set library into a Revit document.
Remarks:
If overwriteExisting is false and a name conflict occurs, Revit will
throw an InvalidOperationException.
document:
The document.
fileName:
Full path to a file containing a property set library definition.
overwriteExisting:
If true, any name conflicts will be resolved by overwriting existing
libraries in the document with those being imported.
Returns:
The new PropertySetLibrary.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.FileArgumentNotFoundException:
The given fileName does not exist.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Attempting to import a property set library with a name that already
exists in the document.
Since:
2012

Autodesk.Revit.DB.PropertySetLibrary.RenameSubclass(System.String,System.String)
Changes the subclass field of all property sets in this library from one value to another.
Remarks:
A subclass can be "deleted" from the library by passing an empty string
as the new subclass.
oldSubclass:
The existing subclass to rename.
newSubclass:
The new subclass applied to all property sets matching the given oldSubclass.
Returns:
The number of property sets whose subclass was changed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ObjectAccessException:
The property set library is read-only.
Since:
2012

Autodesk.Revit.DB.PropertySetLibrary.AddPropertySetWithName(Autodesk.Revit.DB.ElementId,System.String)
Adds a property set from the document to this library using an alternate name.
propertySetId:
Identifier of the property set to add.
name:
The alternate name to use for the property set in the library.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given ElementId does not refer to a PropertySetElement
-or-
The library already contains a property set with the given name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ObjectAccessException:
The property set library is read-only.
Since:
2012

Autodesk.Revit.DB.PropertySetLibrary.AddPropertySet(Autodesk.Revit.DB.ElementId)
Adds a property set from the document to this library.
propertySetId:
Identifier of the property set to add.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given ElementId does not refer to a PropertySetElement
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ObjectAccessException:
The property set library is read-only.
Since:
2012

Autodesk.Revit.DB.PropertySetLibrary.AddToDocumentWithName(System.String,Autodesk.Revit.DB.Document,System.Boolean,System.String)
Adds a property set from a library to the document.  The property set
will be available for use even if the library is unloaded.
name:
The name of the property set in the library to add to the document.
document:
The document to which the property set will be added.
overwrite:
If true, any existing property set with the given name will be overwritten.
addAsName:
The name to use for the new property set element in the document.
Returns:
The new PropertySetElement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
No property set with the given name exists in the library.
-or-
addAsName is an empty string.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
a PropertySetElement with the given name already exists and the overwrite flag is false.
Since:
2012

Autodesk.Revit.DB.PropertySetLibrary.AddToDocument(System.String,Autodesk.Revit.DB.Document,System.Boolean)
Adds a property set from a library to the document.  The property set
will be available for use even if the library is unloaded.
name:
The name of the property set in the library to add to the document.
Will also become the name of the property set element created in the document.
document:
The document to which the property set will be added.
overwrite:
If true, any existing property set with the given name will be overwritten.
Returns:
The new PropertySetElement.
Throws Autodesk.Revit.Exceptions.ArgumentException:
No property set with the given name exists in the library.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
a PropertySetElement with the given name already exists and the overwrite flag is false.
Since:
2012

Autodesk.Revit.DB.PropertySetLibrary.RenamePropertySet(System.String,System.String)
Renames a property set in the library.
name:
The name of the existing property set name to rename.
newName:
The new name for the property set.
Returns:
True if the property set was found and renamed, otherwise false.
Throws Autodesk.Revit.Exceptions.ArgumentException:
No property set with the given name exists in the library.
-or-
The library already contains a property set with the given name.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ObjectAccessException:
The property set library is read-only.
Since:
2012

Autodesk.Revit.DB.PropertySetLibrary.RemovePropertySet(System.String)
Removes a property set with a given name from the library.
name:
The name of the property set name to remove.
Returns:
True if a property set with the given name was found and removed, otherwise false.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ObjectAccessException:
The property set library is read-only.
Since:
2012

Autodesk.Revit.DB.PropertySetLibrary.HasPropertySet(System.String)
Determines whether the library has a property set with a given name.
name:
The property set name to look for.
Returns:
True if the library contains a property set with the given name, otherwise false.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.PropertySetLibrary.SetName(System.String)
Sets the name of the property set library.
Throws Autodesk.Revit.Exceptions.ArgumentException:
name is an empty string.
-or-
name is not unique.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ObjectAccessException:
The property set library is read-only.
Since:
2012

Autodesk.Revit.DB.PropertySetLibrary.GetName
Gets the name of the property set library.
Since:
2012

Autodesk.Revit.DB.PropertySetLibrary.Find(Autodesk.Revit.DB.Document,System.String)
Finds an existing PropertySetLibrary with a given name.
Remarks:
The search is case-insensitive.
doc:
The document in which to look for PropertySetLibrary elements with the given name.
name:
The name to search for.
Returns:
Identifier of the PropertySetLibrary with the given name, or
invalidElementId if no library with that name exists.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.PropertySetLibrary.Create(Autodesk.Revit.DB.Document)
Creates a new property set library in the given document.
document:
The document in which to create the new property set library.
Returns:
The new PropertySetLibrary.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.PropertySetLibrary.ReadOnly
Indicates whether a property set library is read-only or not.
Read-only libraries cannot be renamed, or added to.
Since:
2012

Autodesk.Revit.DB.PropertySetLibrary.Locked
Indicates whether a property set library is locked into a document or not.
Locked libraries are read-only and cannot be removed.
Since:
2012

Autodesk.Revit.DB.PropertySetLibrary
A named collection of property sets.
Remarks:
This class can still read and write property set libraries, but the format it uses is not compatible with the native Revit
adsklib property set library file format.  It may be used for short term use to save and restore a user's own property sets, but this
class may be removed in a future version of Revit.
Since:
2012